Repository: Daniel-KM/Omeka-S-module-OaiPmhHarvester
Catalog: language/*.po
Languages: fr

source: OAI-PMH harvest
fr: Moisson OAI-PMH

source: OAI-PMH harvests
fr: Moissons OAI-PMH

source: Harvesting from "%s" sets
fr: Moissonnage des lots de "%s"

source: %s as %s
fr: %s en %s

source: The harvesting will be limited to period from {from} until {until}.
fr: La moisson sera limitée à la période allant du {from} au {until}.

source: The harvesting will be limited to period from {from}.
fr: La moisson sera limitée à la période depuis le {from}.

source: The harvesting will be limited to period until {until}.
fr: La moisson sera limitée à la période allant jusqu’au {until}.

source: These whitelist filters are used: %s.
fr: Ces filtres en liste blanche sont utilisés : %s.

source: These blacklist filters are used: %s.
fr: Ces filtres en liste noire sont utilisés : %s.

source: Missing endpoint.
fr: Point d’accès manquant.

source: [Untitled repository]
fr: [Entrepôt sans nom]

source: The sets you specified are not correctly formatted.
fr: Les lots que vous avez indiqués ne sont pas correctement formattés.

source: The following formats are not managed: "%s".
fr: Les formats suivants ne sont pas gérés : %s.

source: %s [unmanaged]
fr: %s [non géré]

source: Harvests: %s
fr: Moissons : %s

source: Harvester
fr: Moissonneur

source: View sets
fr: Voir les lots

source: Set repository to harvest
fr: Indiquer le dépôt à moissonner

source: Past Imports
fr: Précédents imports

source: OAI-PMH Harvester
fr: Moissonneur OAI-PMH

source: There are no harvests currently.
fr: Aucune moisson actuellement.

source: Delete harvested resources
fr: Supprimer les ressources moissonnées

source: Undo?
fr: Défaire ?

source: Last message
fr: Dernier message

source: Results
fr: Résultats

source: Job details
fr: Détails de la tâche

source: Harvest: %s
fr: Moisson : %s

source: Deletion: %s
fr: Suppression : %s

source: Problems were detected with the import. Check the job’s log for details.
fr: Des problèmes ont été détectés lors de l’import. Vérifiez les journaux de la tâche pour davantage de détails.

source: Imported: %d %s
fr: Importés : %d %s

source: items
fr: contenus

source: Undone
fr: Défait

source: Undo in progress
fr: Annulation en cours

source: Prepare import
fr: Prépare l’import

source: Harvest
fr: Moisson

source: The repository %1$s (%2$s) has an undefined number of sets.
fr: Le nombre de lots du dépôt %1$s (%2$s) est indéterminé.

source: The repository %1$s (%2$s) has %3$d sets.
fr: Le dépôt %1$s (%2$s) dispose de %3$d lots.

source: Only the first %d are displayed.
fr: Seuls les %d premiers sont affichés.

source: Please choose a set to import.
fr: Merci de choisir un lot à importer.

source: The directory "%s" is not writeable, so the oai-pmh xml responses won’t be storable.
fr: Le dossier « %s » n’est pas accessible en écriture, les réponses xml oai-pmh ne seront donc pas enregistrées.

source: It is now possible to store the oai-pmh xml files received from the repository, in particular to check filters.
fr: Il est désormais possible d’enregistrer les fichiers oai-pmh xml reçus de l’entrepôt, en particulier pour analyser les filtres.

source: It is now possible to set the period (date from/until) to harvest, when supported by the repository.
fr: Il est désormais possible de définir une période (date de/à) à moissonner, si l’entrepôt le gère.

source: Harvests are now run sequencially when there are multiple sets.
fr: Les moissons sont désormais réalisées en séquence lorsqu’il y a plusieurs lots.

source: It is now possible to search items by harvest.
fr: Il est désormais possible de rechercher des contenus par moisson.

source: It is now possible to define the item set for harvested resources. It may be an existing one, a new one or none.
fr: Il est désormais possible de définir la collection pour les ressources moissonnées. Il peut s’agir d’une collection existante, d’une nouvelle collection ou d’aucune.

source: It is now possible to define the harvest mode (skip, append, update, replace, duplicate) instead of always duplicating resources when a harvest is run a second time.
fr: Il est désormais possible de définir le mode de moisson (ignorer, ajouter, mettre à jour, remplacer, dupliquer) au lieu de toujours dupliquer les ressources lorsqu’une moisson est lancée une deuxième fois.

source: The new default harvest mode is "skip", no more "duplicate".
fr: Le nouveau mode de moisson par défaut est « ignorer » et non plus « dupliquer ».

source: not whitelisted
fr: pas en liste blanche

source: [none]
fr: [aucun]

source: Select harvests…
fr: Sélectionner les moissons…

source: The directory "{path}" is not writeable, so the oai-pmh xml responses are not storable.
fr: Le dossier « {path} » n’est pas accessible en écriture, les réponses xml oai-pmh ne peuvent pas être enregistrées.

source: Unable to store xml (verb {verb}).
fr: Impossible d’enregistrer le xml (verbe {verb}).

source: The xml response (verb {verb}) was stored as {url}.
fr: La réponse xml (verbe {verb}) a été stockée en tant que {url}.

source: No endpoint defined.
fr: Aucune url de service définie.

source: The endpoint "{oai_endpoint}" is not a valid url.
fr: Le point d’accès « {oai_endpoint} » n’est pas une url valide.

source: The date "from" {date} is invalid.
fr: La date « depuis » {date} n’est pas valide.

source: The date "until" {date} is invalid.
fr: La date « jusqu’au » {date} n’est pas valide.

source: The date "from" {date_1} cannot be after the date "until" {date_2}.
fr: La date « depuis » {date_1} ne peut être postérieure à la date « jusqu’au » {date_2}.

source: No set defined.
fr: Aucun lot défini.

source: The format {format} is not managed by the module currently.
fr: Le format {format} n’est pas géré par le module actuellement.

source: The formats {formats} are not managed by the module currently.
fr: Les formats {formats} ne sont pas gérés par le module actuellement.

source: The harvest mode "{mode}" is not supported.
fr: Le mode de moisson « {mode} » n’est pas pris en charge.

source: The delete mode "{mode}" is not supported.
fr: Le mode de suppression « {mode} » n’est pas pris en charge.

source: The item set "{item_set_id}" does not exist.
fr: La collection « {item_set_id} » n’existe pas.

source: The option "{mode}" for item set is not supported.
fr: L’option « {mode} » pour la collection n’est pas prise en charge.

source: records
fr: notices

source: harvested
fr: moissonnées

source: whitelisted
fr: en liste blanche

source: blacklisted
fr: en liste noire

source: skipped
fr: ignoré

source: removed
fr: supprimé

source: deleted
fr: terminé

source: updated
fr: mis à jour

source: processed
fr: traité

source: duplicated
fr: dupliqué

source: imported
fr: importées

source: medias
fr: médias

source: errors
fr: erreurs

source: duration
fr: durée

source: marked deleted
fr: marqué supprimé

source: Harvesting started
fr: Moissonnage lancé

source: Start harvesting {oai_url}, format {format}, from {from} until {until}.
fr: Lancement de la moisson {oai_url}, format {format}, de {from} à {until}.

source: Start harvesting {oai_url}, format {format}, from {from}.
fr: Lancement de la moisson {oai_url}, format {format}, à partir de {from}.

source: Start harvesting {oai_url}, format {format}, until {until}.
fr: Lancement de la moisson {oai_url}, format {format}, jusqu’au {until}.

source: Start harvesting {oai_url}, format {format}.
fr: Lancement de la moisson {oai_url}, format {format}.

source: Results: total records = {total}, harvested = {harvested}, marked deleted = {marked_deleted}, not in whitelist = {whitelisted}, blacklisted = {blacklisted}, skipped = {skipped}, removed = {removed}, updated = {updated}, processed = {processed}, deleted resources = {deleted}, imported resources = {imported}, duplicated = {duplicated}, medias = {medias}, errors = {errors}.
fr: Résultats : total des notices = {total}, moissonnées = {harvested}, marquées supprimées = {marked_deleted}, en liste blanche = {whitelisted}, en liste noire = {blacklisted}, ignorées = {skipped}, supprimées = {removed}, mises à jour = {updated}, traitées = {processed}, ressources supprimées = {deleted}, ressources importées = {imported}, doublons = {duplicated}, médias = {medias}, erreurs = {errors}.

source: The job was stopped.
fr: La tâche a été arrêtée.

source: Error: Server unavailable.
fr: Erreur : Serveur indisponible.

source: Error: the harvester does not list records with url {url}.
fr: Erreur : le moissonneur n’a trouvé aucune notice avec l’url {url}.

source: Error.
fr: Erreur.

source: The harvester does not list records with url {url}.
fr: Erreur : le moissonneur n’a trouvé aucune notice avec l’url {url}.

source: The oai record {oai_id} was marked deleted and skipped.
fr: La notice oai {oai_id} a été marquée supprimée et ignorée.

source: The oai record {oai_id} was marked deleted and imported resources were deleted: {resource_ids}.
fr: La notice oai {oai_id} a été marquée supprimée et les ressources importées ont été supprimées : {resource_ids}.

source: The oai record {oai_id} was already imported as resource {resource_id}. New data are skipped.
fr: La notice oai {oai_id} a déjà été importée en tant que ressource #{resource_id}. Les nouvelles données sont ignorées.

source: The oai record {oai_id} was already imported as resource {resource_id}. A new resource is created.
fr: La notice oai {oai_id} a déjà été importée en tant que ressource #{resource_id}. Une nouvelle ressource a été créée.

source: The oai record {oai_id} (resource {resource_id} cannot be updated, because it maps to multiple resources.
fr: La notice oai {oai_id} (ressource {resource_id}) ne peut pas être mis à jour, car il correspond à plusieurs ressources.

source: The oai record {oai_id} was already imported as resource {resource_id}. The resource was completed.
fr: La notice oai {oai_id} a déjà été importée en tant que ressource #{resource_id}. La ressource a été complétée.

source: The oai record {oai_id} was already imported as resource {resource_id}. The resource was updated.
fr: La notice oai {oai_id} a déjà été importée en tant que ressource #{resource_id}. La ressource a été mise à jour.

source: The oai record {oai_id} was already imported as resource {resource_id}. The resource was replaced.
fr: La notice oai {oai_id} a déjà été importée en tant que ressource #{resource_id}. La ressource a été remplacée.

source: The oai record {oai_id} was already imported as resource {resource_id}. The resource cannot be updated.
fr: La notice oai {oai_id} a déjà été importée en tant que ressource #{resource_id}. La ressource ne peut pas être mise à jour.

source: Processing
fr: En traitement

source: Page #{page} processed: total records = {total}, harvested = {harvested}, marked deleted = {marked_deleted}, not in whitelist = {whitelisted}, blacklisted = {blacklisted}, skipped = {skipped}, removed = {removed}, updated resources = {updated}, processed = {processed}, deleted resources = {deleted}, imported resources = {imported}, duplicated = {duplicated}, medias = {medias}, errors = {errors}.
fr: Page #{page} traitée : total des notices = {total}, moissonnées = {harvested}, marquées supprimées = {marked_deleted}, en liste blanche = {whitelisted}, en liste noire = {blacklisted}, ignorées = {skipped}, supprimées = {removed}, mises à jour = {updated}, traitées = {processed}, ressources supprimées = {deleted}, ressources importées = {imported}, doublons = {duplicated}, médias = {medias}, erreurs = {errors}.

source: Harvest ended.
fr: Moisson terminée.

source: Imports of medias should be checked separately.
fr: Les imports des médias doivent être vérifiées séparément.

source: Some records were not imported, probably related to issue on media. You may check the main logs.
fr: Certaines notices n’ont pas été importées, probablement en raison de problèmes sur les médias. Vous pouvez vérifier les journaux.

source: Error: the harvester does not list records with url {url}. Retrying {count}/{total} times in {seconds} seconds
fr: Erreur : le moissonneur n’a trouvé aucune notice avec l’url {url}. Nouvel essai {count}/{total} dans {seconds} secondes

source: {count} resource created from oai record {oai_id}: {resource_id}.
fr: {count} ressource créée à partir de la notice oai {oai_id} : {resource_id}.

source: {count} resources created from oai record {oai_id}: {resource_ids}.
fr: {count} ressources créées à partir de la notice oai {oai_id} : #{resource_ids}.

source: Only {count}/{total} resources created from oai record {oai_id}: {resource_ids}.
fr: Seules {count}/{total} ressources ont été créées à partir de la notice oai {oai_id} : {resource_ids}.

source: No resource created from oai record {oai_id}.
fr: Aucune ressource créée à partir de la notice oai {oai_id}.

source: No resource created from oai record {oai_id}, according to its metadata.
fr: Aucune ressource créée à partir de la notice oai {oai_id}, conformément à ses métadonnées.

source: Unable to store xml for page #{page}, record #{index}.
fr: Impossible d’enregistrer le fichier xml pour la page #{page}, notice #{index}.

source: Unable to store xml for page #{page}.
fr: Impossible de stocker le xml pour la page #{page}.

source: Page #{page}: the xml record {index} was stored as {url}.
fr: Page #{page} : la réponse xml {index} a été enregistrée à {url}.

source: The xml response #{page} was stored as {url}.
fr: La réponse xml #{page} a été stockée sous {url}.

source: The harvest id is not defined.
fr: L’id de la moisson n’est pas défini.

source: The harvest id is not valid.
fr: L’identifiant de la moisson n’est pas valide.

source: The harvest mode is not defined.
fr: Le mode de moisson n’est pas défini.

source: The job "Undo" was stopped: {count}/{total} resources processed.
fr: La tâche "Défaire" a été arrêtée : {count}/{total} notices traitées.

source: Undo stopped.
fr: Arrêt de l’annulation.

source: From date
fr: Depuis la date

source: Date should be UTC. Time is optional. Value is included (≥).
fr: La date doit être en UTC. L’heure est facultative. La valeur est incluse (≤).

source: Optional from time
fr: Depuis l’heure (facultatif)

source: Until date
fr: Jusqu’à la date

source: Date should be UTC. Time is optional. Value is included (≤).
fr: La date doit être en UTC. L’heure est facultative. La valeur est incluse (≤).

source: Optional until time
fr: Jusqu’à l’heure (facultatif)

source: Filters (whitelist)
fr: Filtres (liste blanche)

source: Add strings to filter the input, for example to import only some articles of a journal.
fr: Ajouter des chaînes pour filtrer les entrées, par exemple pour importer seulement certains articles d’une revue.

source: Filters (blacklist)
fr: Filtres (liste noire)

source: Import/update mode for atomic formats
fr: Mode d’import/mise à jour pour les formats atomiques

source: An atomic format is a format where an oai record with an oai identifier maps to a single resource in Omeka. Ead via oai-pmh is not an atomic format, so a reharvest will duplicate records.
fr: Un format atomique est un format dans lequel une notice oai avec un identifiant oai correspond à une seule ressource dans Omeka. Ead via oai-pmh n’est pas un format atomique, donc une nouvelle moisson dupliquera les notices.

source: Skip record (keep existing resource)
fr: Ignorer la notice (conserver la ressource existante)

source: Append new values
fr: Ajouter de nouvelles valeurs

source: Replace existing values and let values of properties not present in harvested record
fr: Remplacer les valeurs existantes et laisser les valeurs des propriétés non présentes dans la notice moissonnée

source: Replace the whole existing resource
fr: Remplacer toute la ressource existante

source: Create a new resource (not recommended)
fr: Créer une nouvelle ressource (non recommandé)

source: Process for oai record marked as deleted
fr: Traitement pour les notices oai marquées supprimées

source: Skip
fr: Ignorer

source: Delete resources previously imported
fr: Supprimer les ressources précédemment importées

source: Delete resources previously imported, whatever the filters
fr: Supprimer les ressources précédemment importées, quels que soient les filtres

source: Item set for items
fr: Collections pour les contenus

source: No item set
fr: Pas de collection

source: Create a new item set
fr: Créer une nouvelle collection

source: Store oai-pmh xml responses
fr: Enregistrer les réponses xml oai-pmh

source: This option allows to investigate issues. Xml files are stored in directory /files/oai-pmh-harvest. The url is indicated in the logs.
fr: Cette option permet de trouver les problèmes. Les fichiers xml sont stockés dans le dossier /files/oai-pmh-harvest. L’url est indiquée dans les logs.

source: By page
fr: Par page

source: By record
fr: Par notice

source: Harvest this set?
fr: Moissonner ce set ?

source: Harvest this set
fr: Moissonner ce set

source: Whole repository
fr: Dépôt entier

source: OAI-PMH endpoint
fr: Point d’accès OAI-PMH

source: The base URL of the OAI-PMH data provider.
fr: L’URL de base du dépôt OAI-PMH.

source: Skip listing of sets and harvest all records
fr: Ignorer la liste des lots et moissonner toutes les notices

source: Skip listing of sets and harvest only these sets
fr: Ignorer la liste des lots et moissonner seulement ces lots

source: Set one set identifier and a metadata prefix by line. Separate the set and the prefix by "=". If no prefix is set, "dcterms" or "oai_dc" will be used.
fr: Indiquer un identifiant de lot et un préfixe de métadonnées par ligne. Séparer le lot et le préfixe par "=". Si aucun préfixe n’est indiqué, "dcterms" ou "oai_dc" seront utilisés.

source: Filters on each record (whitelist)
fr: Filtres pour chaque notice (liste blanche)

source: Filters on each record (blacklist)
fr: Filtres pour chaque notice (liste noire)

source: Store oai-pmh xml response for list of sets
fr: Enregistrer les réponses xml oai-pmh pour la liste des lots

source: See log to get the url.
fr: Consulter les journaux pour avoir l’url.

source: The endpoint "%value%" should not have a query.
fr: Le point d’accès « %value% » ne doit pas avoir une requête.

source: The endpoint "%value%" does not return xml.
fr: Le point d’accès « %value% » ne retourne pas de xml.

source: The endpoint "%value%" does not manage any format.
fr: Le point d’accès « %value% » ne gère aucun format.

source: When set, the "from" date must be before the "until" date.
fr: Lorsqu’elle est définie, la date « jusqu’à » doit être antérieure à la date « depuis ».

source: skip
fr: ignorer

source: append
fr: ajouter

source: update
fr: mettre à jour

source: replace
fr: remplacer

source: duplicate
fr: dupliquer

source: delete
fr: supprimer

source: delete_filtered
fr: supprimer_filtrées

source: This repository has duplicate identifiers for sets, so they are not all displayed. You may warn the admin of the repository.
fr: Ce dépôt a des identifiants en doublon pour les lots et ils ne peuvent pas être tous affichés. Vous pouvez avertir son gestionnaire.

source: At least one repository should be selected.
fr: Au moins un dépôt doit être sélectionné.

source: Harvesting started in background (job %1$s#%2$d%3$s, %4$slogs%3$s). This may take a while.
fr: Moissonnage lancé en arrière-plan (tâche %1$s#%2$d%3$s, %4$sjournaux%3$s). Cela peut prendre un moment.

source: Undo in progress in the following jobs: %s
fr: Annulations en cours pour les tâches suivantes : %s

source: Missing OAI-PMH Harvester configuration
fr: Configuration de la moisson indisponible

source: Past Harvests
fr: Historique des moissons
